### Pandas 라이브러리를 활용한 데이터 수집(mysql)

In [25]:
# Pandas 패키지 불러오기
import pandas as pd
import pymysql
from sqlalchemy import create_engine

In [28]:
# DB 커넥션 열기
engine = create_engine("mysql+pymysql://kopo:kopo@192.168.110.111:3306/kopo")

In [29]:
# DB테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query("SELECT * FROM kopo_product_volume", engine)

In [53]:
# 컬럼해더 재정의
selloutData.columns = ["REGIONID", "PRODUCTGROUP", "YEARWEEK", "VOLUME"]

In [60]:
selloutData.head(3)

  REGIONID PRODUCTGROUP YEARWEEK  VOLUME
0      A01       ST0002   201512  151750
1      A01       ST0001   201520  645626
2      A01       ST0002   201520  125863

In [59]:
# 데이터 저장
resultname="KYUNGHYUN"
selloutData.to_sql(resultname, engine, if_exists="replace", index=False)

### Pandas 라이브러리를 활용한 데이터 수집(oracle)

In [2]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine("oracle+cx_oracle://kopo2019:kopo2019@192.168.110.112:1521/orcl")

selloutData = pd.read_sql_query("SELECT * FROM kopo_product_volume", engine)
selloutData.columns = ["A", "B", "B2", "C"]
resultname="Gang"
selloutData.to_sql(resultname, engine, if_exists="replace", index=False)
selloutData.head(3)

     A       B      B2         C
0  A01  ST0001  201415  810144.0
1  A01  ST0002  201415  128999.0
2  A01  ST0001  201418  671464.0

### Pandas 라이브러리를 활용한 데이터 수집(postgre)

In [5]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine("postgresql://kopo:kopo@192.168.110.111:5432/kopo")

selloutData = pd.read_sql_query("SELECT * FROM kopo_product_volume", engine)
selloutData.columns = ["A", "B", "B2", "C"]
resultname="Gang"
selloutData.to_sql(resultname, engine, if_exists="replace", index=False)
selloutData.head(3)

     A       B      B2       C
0  A01  ST0002  201512  151750
1  A01  ST0002  201520  125863
2  A01  ST0002  201515  128999